{"data":{"site":{"siteMetadata":{"title":"Steveostudios","author":"@steveostudios"}},"markdownRemark":{"id":"81dc1841-144e-58c4-b9ba-9fe9beb58157","excerpt":"So I’m giving blogging another go. This time with Jekyll.\nFor years I have had a  Wordpress  blog that I would occasionally post some stuff on. Mostly posts…","html":"<p>So I’m giving blogging another go. This time with Jekyll.\nFor years I have had a <a href=\"http://wordpress.org/\">Wordpress</a> blog that I would occasionally post some stuff on. Mostly posts that would remind future-Steve what things past-Steve learned as to avoid relearning things. I’m forget things way too easily! Wordpress is a great platform, but I’m not sure it is right for <em>me</em>. Don’t get me wrong, I use Wordpress all of the time for tons of things! I’ve developed plugins, I’ve re-engineered backends, I’ve helped run e-commerce sites from it, and built or edited dozens or Wordpress sites. But I’m not sure Wordpress is for me and my blogging habits (or non-habits?). You see, I’ve never really looked at Wordpress as an effective blogging CMS, but rather a pretty good CMS for just about everything else. And that makes it hard to separate sitting down and writing a post, and fixing a number of other things that go on in a Wordpress install. Also, can we all agree that the WYSIWYG editor in Wordpress is a piece of junk?</p>\n<p>While in another rut, I discovered <a href=\"https://ghost.org/\">Ghost</a>. I ended up backing the Kickstarter by John O’Nolan. I loved the idea of natively writing in <a href=\"http://daringfireball.net/projects/markdown/\">Markdown</a> and stripping out almost all of the features. I want to write, but I don’t want get caught <em>not writing</em> because I am updating plugins or fingind a better theme. I also <em>loved</em> the idea of using <a href=\"https://nodejs.org/\">Node.js</a>. This got me excited about writing again, so in anticipation of Ghost coming out, I wrote a ton in <a href=\"https://evernote.com/\">Evernote</a>. And when Ghost finally was released to backers, I installed it locally and then on the forst AWS server I could figure out how to run it on.</p>\n<p>Then I hit several roadblocks.</p>\n<p>First, editing in a brand-spaniking new engine was <em>hard</em>. I spent about two weeks trying to port over all of my old Wordpress articles because the importer wasn’t finished yet. Then I had to convert images. Then I couldn’t find a theme I liked enough to edit. That’s when I realized that I was running into the very same faults that I had with Wordpress. This frustrated me. It’s not Ghost’s fault - I’m sure they have worked most of these things out by now and the community is growing daily, but I needed something that I could write distraction free.</p>\n<p>One other note, is that I wanted to spend very little money on a blog. I don’t plan on ever monitizing my blog (since, again, it’s really just a public reminder/idea board), and I would go spurts of months without a peep on it, I thought it silly to pay $5 a month on something I don’t use. After my free trial of Amazon AWS expired I decided to leave Ghost behind (maybe just until a free tier hosting opened up or I piggy-backed it on another node server).</p>\n<p>That’s when a friend introduced me to <a href=\"http://postach.io/sites/\">Postach.io</a>, which changed the way I thought about posting content. Postach.io lets you use Evernote (or Dropbox) as your CMS, simply by placing post-notes in a specified notebook and tagging them as a “post”. They would just magically show up in your blog! Since I already wrote most of my drafts for posts in Evernote, and Postach.io was a dream come true! Sure it was super limiting, but that is exactly what I wanted! And, as if having a great tool at your disposal wasn’t enough, service was free with a premium tier for features I didn’t need. <strong>Perfect</strong>!</p>\n<p>Lo, Postach.io announced that it was shutting down it’s free service and going 100% premium.</p>\n<p>About this time I started listening to a bunch of podcasts that said if you want to get better at what you’re doing, writing/coding/whatever, blog about it and let the world critique you. Defeated by CMS’s but determined to comtinue the trend of writing I was ready to hit publish on yet another Wordpress install. But, more and more of these nerdy podcasts were throwing out <a href=\"http://jekyllrb.com/\">Jekyll</a> as a platform worth a try. After a few days of Googling, trying to understand the concept of a static blogging platform, I decided the best way learn what it is is to fire up an install and start posting. The worst thing that can happen is I figure out it’s not for me and try another service.</p>\n<p>So far, (this <em>one post</em>!) it seems to be awesome. But we’ll see. I’m excited again. I want to learn more, but not to the fault of <em>not blogging</em>. So stay tuned, and I’ll try to share my experieces with you.</p>","frontmatter":{"title":"A New Start","date":"April 12, 2015"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/a-new-start/2015-04-12-a-new-start/","previous":{"fields":{"slug":"/git-solo/"},"frontmatter":{"title":"Git for Solo Development"}},"next":null}}