{"data":{"site":{"siteMetadata":{"title":"Steveostudios","author":"@steveostudios"}},"markdownRemark":{"id":"5d8e79ea-3b69-51d5-8b89-1c35762fa9db","excerpt":"A few weeks ago I posted about  local-npm-packages . While this is cool, one of the major drawbacks that I noted is that you can’t share or collaborate with…","html":"<p>A few weeks ago I posted about <a href=\"/local-npm-packages\" title=\"Local NPM Packages\">local-npm-packages</a>.</p>\n<p>While this is cool, one of the major drawbacks that I noted is that you can’t share or collaborate with this. The package is completely local.</p>\n<p>After that post I decided I need to post that package somewhere, but I’m not committed enough to needing a private npmjs subscription. I wanted to find out whether or not I can post that package on a server I already own. It turns out that the wonderful folks at npm have provided a way for this!\nYou can host a package a number of different ways and use npm to pull those packages, even from other sources.</p>\n<div class=\"gatsby-highlight\" data-language=\"shell\"><pre class=\"language-shell\"><code class=\"language-shell\">npm i git+ssh://git@gitlab.com:organization/my-package#1.0.0 -D</code></pre></div>\n<h2>Here are some pros to this:</h2>\n<ol>\n<li>It can be private or public, depending on the repo.</li>\n<li>If you have free private repos then it’s free!</li>\n</ol>\n<h2>…and the cons:</h2>\n<ol>\n<li>The semver distribution isn’t as cool. It’s using a git repo and not a package version, so you have to use tags to version your package. From what I can tell it’s just not as polished.</li>\n<li>npm has done a ton of amazing performance tricks to make npm sing. You don’t get that out of the box whan you host it yourself on a git service. Which is totally fair. Their made to server</li>\n<li>git, which is not npm packages!</li>\n</ol>\n<p>You can find more info over at the <a href=\"https://docs.npmjs.com/cli/install\" title=\"npmjs docs\">npm docs</a>.</p>","frontmatter":{"title":"Git NPM Packages","date":"July 29, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/git-npm-packages/","previous":{"fields":{"slug":"/local-npm-packages/"},"frontmatter":{"title":"Local NPM Packages"}},"next":{"fields":{"slug":"/getting-started-with-mocha/"},"frontmatter":{"title":"Getting Started with Mocha testing in Javascript"}}}}