{"data":{"site":{"siteMetadata":{"title":"Steveostudios","author":"@steveostudios"}},"markdownRemark":{"id":"fbf42fa3-e056-517a-81eb-4212a8f5d59c","excerpt":"Today I want to introduce you to Read It Later, a nifty little web app that can change the way you read. Lets say that you are surfing through Twitter and see…","html":"<p>Today I want to introduce you to Read It Later, a nifty little web app that can change the way you read. Lets say that you are surfing through Twitter and see an article that you want to read, but the length of the article and your time to read it do not coincide. You could a) Skim the article and get through it, but lose valuable information, b) try to remember the URL for later, c) forget the article and pretend it never existed, or d) Read It Later.</p>\n<p>Read is later is a free service that you use to compile articles or websites for later consumption. You can use the website (<a href=\"http://readitlater.com/\">readitlaterlist.com</a>) to compile your list, or use it via the services menu in most <a href=\"http://itunes.apple.com/us/app/twitter/id333903271?mt=8\">applications</a> (over 300 at the time of this writing), including <a href=\"http://itunes.apple.com/us/app/twitter/id333903271?mt=8\">Twitter</a> and <a href=\"http://itunes.apple.com/us/app/reeder/id325502379?mt=8\">Reeder</a>. They also have plugins and extensions that run in your browser of choice that you can use to quickly add a page to your list.</p>\n<p>Later (when you’re ready to read) you can scroll through your list and pick out the articles you wish to read. You can then mark them as read, favorite them, or delete them. When they are marked as read, they are forever saved in a list, letting you access them 6 months later when you need to remember again! There is even a Mac app called <a href=\"http://itunes.apple.com/us/app/read-later-best-client-for/id409349978?mt=12\">Read Later</a> that is awesome for quickly scrolling through articles when you have a day off.</p>","frontmatter":{"title":"Read It Later","date":"April 20, 2012","tags":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2012-04-20-read-it-later/","previous":{"fields":{"slug":"/2019-04-02-git-solo/"},"frontmatter":{"title":"Git for Solo Development"}},"next":null}}