{"data":{"site":{"siteMetadata":{"title":"Steveostudios","author":"@steveostudios"}},"markdownRemark":{"id":"af802491-2db6-547c-bffc-bafcdc5ac267","excerpt":"I just discovered  Sails.js , a realtime MVC framework for Node.js. To be honest, I am not even completely sure an MVC means (I know it means Model-View…","html":"<p>I just discovered <a href=\"https://sailsjs.org/\">Sails.js</a>, a realtime MVC framework for Node.js.</p>\n<p>To be honest, I am not even completely sure an MVC means (I know it means Model-View-Controller). I’ve spent hours reading nerdy-article after nerdy-article about MVC and the pros and cons, and how its so simple and whatnot. I understand that it is something I need to know, but my mind hasn’t grasped it yet.</p>\n<p>That all being said, I discovered Node because I wanted to do a project involving sockets, which, from my understanding can be done in almost any language, but Node developers seem to be talking non-stop about it. I also knew that I wanted an MVC for the framework of my node project. So I searched GitHub and really only found one guy who made an <a href=\"https://github.com/madhums/node-express-mongoose-demo\">MVC framework for Node</a> that I could follow. What then transpired was 6 months of building an app that may one day see the light of day.</p>\n<p>Then, the other day I discovered <a href=\"https://sailsjs.org/\">Sails.js</a>. If you’re interested, watch the video below.</p>\n<p>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 50%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <div><iframe src=\"http://youtu.be/GK-tFvpIR7c\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe></div>\n          </div>\n          </p>\n<p>I like that it has Express, <a href=\"https://socket.io/\">Socket.io</a>, and the database already ready to go. I like that it has a ton of other features that I have heard of but have no idea what they do (yet!). I’m super stoked.</p>","frontmatter":{"title":"Sails.js","date":"March 13, 2014","tags":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2014-03-13-sailsjs/","previous":{"fields":{"slug":"/2019-04-02-git-solo/"},"frontmatter":{"title":"Git for Solo Development"}},"next":null}}