{"data":{"site":{"siteMetadata":{"title":"Steveostudios","author":"@steveostudios"}},"markdownRemark":{"id":"97e6d1f7-f16a-59da-9560-f2af64ea5326","excerpt":"Lately I have been diving into Atom Shell for some apps that Dave and I are writing. We’re super excited to share them with you later this year. Last week as I…","html":"<p>Lately I have been diving into Atom Shell for some apps that Dave and I are writing. We’re super excited to share them with you later this year.</p>\n<p>Last week as I was working on one of these apps I was having some issues and googled the error to see what I could find. My search results all fit my description, but linked to some ‘electron’ instead of ‘atom-shell’. Weird. And then I saw the latest commit was only a few hours before. Ahah! Atom Shell had officially changed it’s name (about time in my opinion!)</p>\n<!--more-->\n<p>For those of you that don’t know, <em><a href=\"https://atom.io/\">Atom</a></em> (not Atom Shell - see the confusion?) is a text editor created by the wonderful folks at GitHub. It’s full-featured, hackable, cross-platform, and looks to be a great replacement editor, although I am not ready to switch away from Sublime Text yet. Atom is written using the <em>Atom Shell</em>, well, shell. Atom Shell is a framework for writing cross-platform apps in HTML, JS, and CSS, based on io.js (fork of node.js) and Chromium (the backend behind Google Chrome). So basically you can write apps using web languages that run on top of a “chrome browser” window.</p>\n<p>Atom Shell has now been renamed to <a href=\"http://electron.atom.io/\">Electron</a> and moved to an open-source project, still lead by the GitHub Atom team.</p>\n<p>I’m super stoked that it’s gaining the traction that it is and looking forward to making some cool things with it!</p>","frontmatter":{"title":"Atom Shell is now Electron","date":"April 30, 2015"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2015-04-30-atom-shell-is-now-electron/","previous":{"fields":{"slug":"/2015-04-29-hiding-jekyll-posts-and-pages/"},"frontmatter":{"title":"Hiding Jekyll Posts and Pages"}},"next":{"fields":{"slug":"/2017-04-20-sketch-export-magic/"},"frontmatter":{"title":"Sketch Magic Export"}}}}